11/data/attachments/c893423aa694e9f2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4a30ecd8-5f2c-444f-848c-1a470a06c87e</nif:username>
            <nif:friendToBeAdded>Luke_can_Friend_73399_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>